app/Controllers/Home.php

    public function index()
    {
        $sitesModel = new \App\Models\SitesModel();
        $sites = $sitesModel->where('act', 1)->findAll();
---
SELECT *
FROM `site`
WHERE `act` = 1