app/Controllers/Sites.php

SELECT *
FROM `site`
WHERE `site`.`idsite` = '1'
SELECT *
FROM `page`
WHERE `idsite` = '1'
AND `act` = 1
---
    public function index($idsite)
    {
        $sitesModel = new \App\Models\SitesModel();
        $pagesModel = new \App\Models\PagesModel();
        $site = $sitesModel->find($idsite);
        $pages = $pagesModel->where('idsite', $site->idsite)->where('act', 1)->findAll();

SELECT *
FROM `page`
WHERE `page`.`idpage` = '26'
SELECT *
FROM `site`
WHERE `site`.`idsite` = '1'
---
    public function viewPage($idpage)
    {
        $pagesModel = new \App\Models\PagesModel();
        $sitesModel = new \App\Models\SitesModel();
        $imagesModel = new \App\Models\ImagesModel();
        $page = $pagesModel->find($idpage);
        if($page){

            $site = $sitesModel->find($page->idsite);

SELECT *
FROM `site`
WHERE `site`.`idsite` = '4'
---
    public function setXML($idsite)
    {
        $sitesModel = new \App\Models\SitesModel();
        $site = $sitesModel->find($idsite);

SELECT *
FROM `site`
WHERE `site`.`idsite` = '5'
UPDATE `site` SET `xmlpages` = '<urlset xmlns=\"http://www.sitemaps.org/schemas/sitemap/0.9\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:schemaLocation=\"http://www.sitemaps.org/schemas/sitemap/0.9 http://www.sitemaps.org/schemas/sitemap/0.9/sitemap.xsd\">\r\n   <url>\r\n      <lastmod>2020-07-23T08:47:37Z</lastmod>\r\n      <loc>https://www.urheilu.com/vedonlyonti</loc>\r\n      <priority>0.8</priority>\r\n   </url>\r\n</urlset>'
WHERE `site`.`idsite` IN ('5')
SELECT *
FROM `page`
WHERE `idsite` = '5'
AND `act` = 1
---
    public function scanXML($idsite)
    {
        $idsite = $this->request->getVar('idsite');
        $sitemapXml = $this->request->getVar('sitemapXml');
        $sitesModel = new \App\Models\SitesModel();
        $site = $sitesModel->find($idsite);
        $dataHeader["title"] = $site->domain;
        $dataHeader["detail"] = "<div class='mt-4 mb-2 text-start'><strong>Username N.nu:</strong> ".$site->nick;
        $dataHeader["detail"] .= "<br><strong>Searching content by:</strong><br>";
        $dataHeader["detail"] .= "<ul>".
                                    "<li>Tag: ".$site->tagcontent."</li>".
                                    "<li>Class: ".$site->classcontent."</li>".
                                    "<li>Id: ".$site->idcontent."</li>"
                                ."</ul>";
        $dataHeader["detail"] .= "</div>";

        $objectXml = simplexml_load_string($sitemapXml);
        if ($objectXml === FALSE) {
            $data["error"] = "There were errors parsing the XML file.";
        }
        else{
            $data = [
                'xmlpages' => $sitemapXml,
            ];
            $sitesModel->update($idsite, $data);
        }

        $pagesModel = new \App\Models\PagesModel();
        $savedPages = $pagesModel->where('idsite', $idsite)->where('act', 1)->findAll();

SELECT *
FROM `site`
WHERE `site`.`idsite` = '4'
SELECT *
FROM `page`
WHERE `path` = 'esports/peliesittelyt'
AND `idsite` = '5'
---
    public function savePage($idsite)
    {
        $sitesModel = new \App\Models\SitesModel();
        $site = $sitesModel->find($idsite);
        $loc = $this->request->getVar('loc');
        //+++++++++++++ AQUI COLOCAR EL PROCESO DE html SCRIPLING
        $format = "";
        if($site->classcontent)
        {$format = '//'.$site->tagcontent.'[@class="'.$site->classcontent.'"]'; }
        if($site->idcontent)
        {$format = '//'.$site->tagcontent.'[@id="'.$site->idcontent.'"]'; }

        $post = new Post($loc, $format, 'https://cdn.esportsvikings.se', 'https://cdn.esportsvikings.se');
        $post->getPostInfo();
        $title = $post->getPostTitle();
        $descriptionpage = $post->getMetaDescription();
        $content = $post->getPostContent();
        $images = $post->getPostImages();
        //-----------------------------------------------------------
        $pagesModel = new \App\Models\PagesModel();
        $whereArray = array('path' => trim(str_replace($site->domain,'',$loc)), 'idsite' => $site->idsite);
        $foundPage = $pagesModel->where($whereArray)->findAll();

SELECT *
FROM `image`
WHERE `url` = 'https://cdn.urheilu.com/images/esports_postcards/league-of-legends-urheilu_postcard_400x210.jpg'
---
        foreach($images as $imageString)
        {
            $image = json_decode($imageString); //++++ encode to json, so we have to decode
            $foundImage = $imagesModel->where('url', trim($image->url))->findAll();

INSERT INTO `page_image` (`idpage`, `idimage`) VALUES (23, 58)
---
                    'idpage' => $idPage,
                    'idimage' => $foundImage[0]->idimage
                ];
                $pageImageModel->insert($data);

INSERT INTO `image` (`name`, `url`, `urlnnu`, `act`) VALUES ('apex-legends-race-asia-2020-jp-news-spread_viking_1920x500.jpg?compress=1', 'https://cdn.esportsvikings.jp/images/images/apex-legends-race-asia-2020-jp-news-spread_viking_1920x500.jpg?compress=1', '', 1)
---
                    'urlnnu'=> '',
                    'act'=> 1,
                ];
                $imagesModel->insert($data);

INSERT INTO `page_image` (`idpage`, `idimage`) VALUES (1738, 1829)
---
                    'idpage' => $idPage,
                    'idimage' => $idImage
                ];
                $pageImageModel->insert($data);